{
  "backend/main.mo": "Main Motoko actor implementing user profiles, presence tracking, messaging structures, and access-controlled APIs, including persistent data maps and profile management functions.",
  "backend/migration.mo": "Migration module converting old userPresence data (Bool) to new format with last-seen timestamps, defaulting timestamps to 0.",
  "feature_evidence.json": "Feature evidence report mapping presence-related features to impacted frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing styling, components, hooks, screens, and presence-related UI behavior.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, dark mode overrides, global border and background rules.",
  "frontend/index.html": "Basic HTML entrypoint containing root div and script loading the React application.",
  "frontend/src/App.tsx": "Root React application configuring routing, theme, query client, identity provider, and splash handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting new users for name and optional phone number, validating input and saving profiles via backend.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication gate that redirects unauthenticated users to the login screen and shows a loading spinner while initializing.",
  "frontend/src/components/chat/ChatBubble.tsx": "Renders incoming or outgoing chat bubbles with text, timestamps, status icons, and optional file or image attachments.",
  "frontend/src/components/chat/ChatThread.tsx": "Displays a full chat thread, merging backend and optimistic messages, handling sending logic, scrolling, presence, and header actions.",
  "frontend/src/components/chat/MessageInputBar.tsx": "Provides a text and file input bar for composing and sending messages with attachment handling and validation.",
  "frontend/src/components/contacts/AddContactDialog.tsx": "Modal dialog allowing users to add contacts via principal ID or phone number with validation and submission states.",
  "frontend/src/components/contacts/ContactsPanel.tsx": "Shows the contact list with presence indicators and a button to add new contacts via the AddContactDialog.",
  "frontend/src/components/conversations/ConversationsList.tsx": "Lists contacts as conversation entries with presence info and lets users select a conversation.",
  "frontend/src/components/layout/NeonScaffold.tsx": "Provides the neon-themed app layout wrapper with background effects and an Outlet for nested routes.",
  "frontend/src/components/presence/PresenceDot.tsx": "Simple presence indicator dot showing online or offline status.",
  "frontend/src/components/presence/PresenceStatusText.tsx": "Displays online status or formatted last-seen text based on presence data.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar with optional photo, initials fallback, and size variants.",
  "frontend/src/components/splash/LogoSplashOverlay.tsx": "Displays a timed splash animation with enter/hold/exit phases and triggers a completion callback.",
  "frontend/src/components/status/StatusComposerDialog.tsx": "Provides a dialog for composing statuses with text, photo, video, or audio, including validation and upload handling.",
  "frontend/src/components/status/StatusViewer.tsx": "Displays statuses with navigation, audio handling, author info, and delete support.",
  "frontend/src/components/status/useSwipeNavigation.ts": "Hook enabling left/right swipe detection on a referenced container.",
  "frontend/src/components/status/VisibleStatusesList.tsx": "Groups statuses by author and renders a scrollable list with previews and selection handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, and identity loading.",
  "frontend/src/hooks/useLogoSplash.ts": "Controls when the splash screen is shown based on animation timing and initialization state.",
  "frontend/src/hooks/usePresenceHeartbeat.ts": "Sends periodic presence heartbeats and updates presence on visibility changes or unmount.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Listens for the PWA install prompt event and exposes a function to trigger installation.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, photos, contacts, and related actor-backed data.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, neon/cyber utilities, and splash animation styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AdminHelpScreen.tsx": "Displays admin status, principal tools, and explanations for admin access with navigation controls.",
  "frontend/src/pages/ChatScreen.tsx": "Main chat UI handling presence, navigation, profile access, and contact/thread interaction.",
  "frontend/src/pages/DownloadInstallScreen.tsx": "Shows install instructions and PWA install button, with link copying and navigation.",
  "frontend/src/pages/LoginScreen.tsx": "Renders the login UI using Internet Identity, handles login flow, errors, and redirects when authenticated.",
  "frontend/src/pages/PremiumScreen.tsx": "Displays premium feature previews with a placeholder upgrade action and navigation back to the main screen.",
  "frontend/src/pages/ProfilePhotoScreen.tsx": "Allows users to upload, validate, preview, and save a new profile photo with size and resolution checks and progress tracking.",
  "frontend/src/pages/ProfileScreen.tsx": "Shows and edits user profile details including name, phone, principal ID, and profile photo, with validation and save handling.",
  "frontend/src/pages/StatusScreen.tsx": "Displays visible statuses, provides a composer for creating new ones, and includes a viewer with delete handling and navigation.",
  "frontend/src/utils/audioUrlFetch.ts": "Fetches and validates audio files from URLs, enforcing audio content type and a 1GB size limit.",
  "frontend/src/utils/audioValidation.ts": "Provides helpers to validate audio files and byte arrays for type and size, including human-readable size formatting.",
  "frontend/src/utils/formatLastSeen.ts": "Converts a nanosecond timestamp into a human‑readable last‑seen string with relative time rules.",
  "frontend/src/utils/imageValidation.ts": "Decodes images to read dimensions, checks against a 100MP limit, and formats file sizes.",
  "frontend/src/utils/phoneNumber.ts": "Normalizes and validates phone numbers to E.164 format with digit and length checks.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL parameters with session persistence and hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, fonts, and container settings with additional plugins.",
  "project_state.json": "Describes project scope, architecture notes, issues, and implemented features for the Jero chat app."
}