{
  "kind": "build_request",
  "title": "Add last-seen timestamps and improve online/offline presence UI indicators",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-58",
      "text": "Extend the Motoko backend presence system to track and expose a user’s last-seen time in addition to online/offline state.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "If you want, I can now make the app show:\n• Green dot = online\n• Grey dot = offline\n• Last seen time\nJust tell me and I will add it.\nUser: Ok do it"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores a per-user last-seen timestamp that updates whenever the user is marked online (e.g., heartbeat) and when the user is marked offline (tab hidden/unmount/logout).",
        "Backend exposes a query API that returns both presence state and last-seen timestamp for a given Principal (and returns a sensible value when last-seen is unknown).",
        "Existing presence checks continue to work (do not break current callers that use the existing isUserOnline query).",
        "All backend error text (if any) remains in English."
      ]
    },
    {
      "id": "REQ-59",
      "text": "Update the React Query layer to fetch presence as a combined presence+last-seen payload and use it in the chat header, conversations list, and contacts list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Green dot = online\n• Grey dot = offline\n• Last seen time\nJust tell me and I will add it.\nUser: Ok do it"
        ]
      },
      "acceptanceCriteria": [
        "A new/updated React Query hook exists to retrieve a contact’s presence state plus last-seen time from the backend.",
        "The chat header (ChatThread) uses the new presence payload and no longer relies on hardcoded or partial presence data.",
        "ConversationsList and ContactsPanel items use the new presence payload consistently for the same contact.",
        "Presence polling remains enabled (refresh-based updates are acceptable), and the UI updates within the existing polling interval without requiring real-time sockets."
      ]
    },
    {
      "id": "REQ-60",
      "text": "Implement the requested presence UI behavior: show a green dot when a contact is online, a grey dot when offline, and display a human-readable “Last seen …” time when offline and a last-seen timestamp is available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Green dot = online\n• Grey dot = offline\n• Last seen time"
        ]
      },
      "acceptanceCriteria": [
        "In the chat header, a presence dot is always shown: green when online, grey when offline (do not hide the indicator when offline).",
        "In ConversationsList and ContactsPanel, a presence dot is always shown: green when online, grey when offline.",
        "When offline and a last-seen timestamp is available, the UI displays English text in the form “Last seen HH:MM” (or equivalent concise English) using a consistent locale/format across the app.",
        "When offline and last-seen is not available, the UI displays “Offline” (English).",
        "When presence info is still loading or unavailable, the UI displays a clear English fallback such as “Status unavailable”, and the dot does not incorrectly show green (online)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any files under frontend/src/components/ui or any path listed in frontend.immutablePaths.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not implement real-time presence via WebSockets or any push mechanism.",
    "Do not add push notifications.",
    "Do not add a new full profile viewer screen from chat (not requested in the final user approval).",
    "Do not redesign the overall neon theme beyond what is necessary to add the dot/last-seen UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}